arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/artic_r2/artic.cpp
    // Config burst register
    burst_reg |= BURST_MODE_SHIFT_BITMASK;
    burst_reg |= ((mem_sel << MEM_SEL_SHIFT) & MEM_SEL_BITMASK);
    if (read)
        burst_reg |= BURST_R_NW_MODE_BITMASK;

    burst_reg |= (start_address & BURST_START_ADDRESS_BITMASK);

    buffer_tx[0] = ARTIC_WRITE_ADDRESS(BURST_ADDRESS);
    buffer_tx[1] = burst_reg >> 16;
    buffer_tx[2] = burst_reg >> 8;
    buffer_tx[3] = burst_reg;

    ret = m_nrf_spim->transfer(buffer_tx, buffer_rx, 4);
    if (ret) {
        throw ErrorCode::SPI_COMMS_ERROR;
    }

    nrf_delay_ms(SAT_ARTIC_DELAY_SET_BURST_MS);
}

void ArticTransceiver::burst_access(mem_id_t mode, uint32_t start_address, const uint8_t *tx_data, uint8_t *rx_data, size_t size, bool read )
{
    uint8_t length_transfer;

    // Set burst register to configure a burst transfer
    configure_burst(mode, read, start_address);

    if (mode == PMEM) // PMEM is a 4 byte register
        length_transfer = 4;
    else // The rest are 3
        length_transfer = 3;

    send_burst(tx_data, rx_data, size, length_transfer, read);

    // Deactivate SSN pin
    m_nrf_spim->finish_transfer();

    nrf_delay_ms(SAT_ARTIC_DELAY_FINISH_BURST_MS);
}

void ArticTransceiver::send_burst(const uint8_t *tx_data, uint8_t *rx_data, size_t size, uint8_t length_transfer, bool read)
{
    uint16_t num_transfer = size / length_transfer;

    // Write in chunk of 60 bytes and wait 5 ms
    uint8_t buffer[SIZE_SPI_REG_PMEM];
    int ret;

    // buffer for saving memory when not needed
    std::memset(buffer, 0, SIZE_SPI_REG_PMEM);

    if (read)
    {
        for (uint32_t i = 0; i < num_transfer; ++i)
        {
            ret = m_nrf_spim->transfer_continuous(buffer, &rx_data[i * length_transfer], length_transfer);
            if (ret) {
                throw ErrorCode::SPI_COMMS_ERROR;
            }

            // LW: This delay appears to be necessary -- removing it causes
            // CRC verification errors during FW upload
            nrf_delay_us(SAT_ARTIC_DELAY_TRANSFER_US);
        }
    }
    else
    {
        for (uint32_t i = 0; i < num_transfer; ++i)
        {
            ret = m_nrf_spim->transfer_continuous(&tx_data[i * length_transfer], buffer, length_transfer);
            if (ret) {
                throw ErrorCode::SPI_COMMS_ERROR;
            }
            // LW: This delay appears to be necessary -- removing it causes
            // CRC verification errors during FW upload
            nrf_delay_us(SAT_ARTIC_DELAY_TRANSFER_US);
        }
    }
}

void ArticTransceiver::spi_read(mem_id_t mode, uint32_t start_address, uint8_t *buffer_read, size_t size)
{
    std::memset(buffer_read, 0, size);
    burst_access(mode, start_address, NULL, buffer_read, size, true);
}

void ArticTransceiver::get_and_print_status(void)
{
    uint32_t status;
    get_status_register(&status);

    for (uint32_t i = 0; i < TOTAL_NUMBER_STATUS_FLAG; ++i)
    {
        if (status & (1 << i)) {
            DEBUG_TRACE("ArticTransceiver::status_bit=%s", (char *)status_string[i]);
        }
    }
}

void ArticTransceiver::print_status(uint32_t status)
{
    for (uint32_t i = 0; i < TOTAL_NUMBER_STATUS_FLAG; ++i)
    {
        if (status & (1 << i)) {
            DEBUG_TRACE("ArticTransceiver::status_bit=%s", (char *)status_string[i]);
        }
    }
}

void ArticTransceiver::clear_interrupt(uint8_t interrupt_num)
{
    switch (interrupt_num)
    {
        case INTERRUPT_1:
            send_command(ARTIC_CMD_CLEAR_INT1);
            break;
        case INTERRUPT_2:
            send_command(ARTIC_CMD_CLEAR_INT2);
            break;
        default:
        	break;
    }
}

void ArticTransceiver::send_command(uint8_t command)
{
    uint8_t buffer_read;
    int ret;

    ret = m_nrf_spim->transfer(&command, &buffer_read, sizeof(command));
    if (ret) {
        throw ErrorCode::SPI_COMMS_ERROR;
    }
}

void ArticTransceiver::wait_interrupt(uint32_t timeout_ms, uint8_t interrupt_num, uint32_t status_flag_bits)
{
    uint32_t delay = 0;
    uint32_t status = 0, old_status = 0;

    if (interrupt_num != NO_INTERRUPT) {
        // Disable async interrupts if polling
        m_irq_int[interrupt_num]->disable();
    }

    do
    {
    	nrf_delay_ms(SAT_ARTIC_DELAY_TICK_INTERRUPT_MS);
    	if (interrupt_num != NO_INTERRUPT && m_irq_int[interrupt_num]->poll()) {
    		DEBUG_TRACE("ArticTransceiver::wait_interrupt: IRQ set");
        	get_status_register(&status);
    		clear_interrupt(interrupt_num);
    		if (status_flag_bits == 0)
    			break;
    	} else
        	get_status_register(&status);
    	if (old_status != status) {
    		print_status(status);
    		old_status = status;
    	}
    	delay += SAT_ARTIC_DELAY_TICK_INTERRUPT_MS;
    } while ((status & status_flag_bits) != status_flag_bits && delay < timeout_ms);

    if (delay == timeout_ms && (status & status_flag_bits) != status_flag_bits)
    {
        DEBUG_TRACE("ArticTransceiver::wait_interrupt: Waiting for interrupt=%u wanted_status=%08x status=%08x", interrupt_num + 1, status_flag_bits, status);
        throw ErrorCode::ARTIC_IRQ_TIMEOUT;
    }
}

void ArticTransceiver::send_command_check_clean(uint8_t command, uint8_t interrupt_number, uint32_t status_flag_bits, uint32_t interrupt_timeout_ms)
{
    send_command(command);
    wait_interrupt(interrupt_timeout_ms, interrupt_number, status_flag_bits);
}

void ArticTransceiver::send_command_check_clean_async(uint8_t command, uint8_t interrupt_number, uint32_t status_flag_bits,
		uint32_t interrupt_timeout_ms,
		std::function<void()> on_success)
{
    send_command(command);

    m_timeout_task = system_scheduler->post_task_prio([this, interrupt_number]() {
        DEBUG_ERROR("ArticTransceiver::wait_interrupt: Waiting for interrupt_%u timed out", interrupt_number + 1);
        m_irq_int[interrupt_number]->disable();
        m_notification_callback(ArgosAsyncEvent::ERROR);
        //throw ErrorCode::ARTIC_IRQ_TIMEOUT;
    }, "CommandTimeoutTask", Scheduler::DEFAULT_PRIORITY, interrupt_timeout_ms);

    m_irq_int[interrupt_number]->enable([this, interrupt_number, status_flag_bits, on_success]() {

    	system_scheduler->cancel_task(m_timeout_task);

    	uint32_t status = 0;
        get_status_register(&status);
        clear_interrupt(interrupt_number);
        m_irq_int[interrupt_number]->disable();

