arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/artic_r2/artic.cpp
        if ((status & status_flag_bits) == 0) {
            m_notification_callback(ArgosAsyncEvent::ERROR);
        	//throw ErrorCode::ARTIC_INCORRECT_STATUS;
            return;
        }

        on_success();
    });
}

void ArticTransceiver::hardware_init()
{
	GPIOPins::clear(BSP::GPIO::GPIO_SAT_RESET);
	GPIOPins::clear(BSP::GPIO::GPIO_SAT_EN);
    m_is_powered_on = false;
    m_is_rx_enabled = false;
}

void ArticTransceiver::send_fw_files(std::function<void()> on_success)
{
    m_mem_sel = 0;
    m_bytes_total_read = 0;

    // Reset firmware file read position to start before reading header
    m_firmware_file.seek(0);
    m_firmware_file.read((unsigned char *)&m_firmware_header, sizeof(m_firmware_header));

    run_until(m_deferred_task_stopped, [this](){

        // First transfer of the section?
        if (m_bytes_total_read == 0) {
            static const mem_id_t order_mode[NUM_FIRMWARE_FILES_ARTIC] = {XMEM, YMEM, PMEM};
            m_mode = order_mode[m_mem_sel];

            // Reset counters
            m_bytes_pending = 0;
            m_last_address = 0;
            m_start_address = 0;

			// Select number of transfer needed and the size of next section to transfer
			switch (m_mode)
			{
				case PMEM:
					m_size = m_firmware_header.PMEM_length;
					m_length_transfer = SIZE_SPI_REG_PMEM;
					break;
				case XMEM:
					m_size = m_firmware_header.XMEM_length;
					m_length_transfer = SIZE_SPI_REG_XMEM_YMEM_IOMEM;
					break;
				case YMEM:
					m_size = m_firmware_header.YMEM_length;
					m_length_transfer = SIZE_SPI_REG_XMEM_YMEM_IOMEM;
					break;
				case INVALID_MEM:
				case IOMEM:
				default:
					break;
			}
        }

    	// Prepare next chunk to program
        while (m_bytes_total_read < m_size)
        {
            uint32_t address = 0;
            uint32_t data = 0;
            uint8_t buffer[MAXIMUM_READ_FIRMWARE_OPERATION];

            // Read 3 bytes of address and 3/4 bytes of data
            m_firmware_file.read(buffer, FIRMWARE_ADDRESS_LENGTH + m_length_transfer);

            // Check next address and next data
            std::memcpy(&address, buffer, FIRMWARE_ADDRESS_LENGTH);
            std::memcpy(&data, buffer + FIRMWARE_ADDRESS_LENGTH, m_length_transfer);

            // Sum bytes read from the file
            m_bytes_total_read += FIRMWARE_ADDRESS_LENGTH + m_length_transfer;

			//DEBUG_TRACE("ArticTransceiver::send_fw_files: mem_sel=%u pending=%u last_address=%06x address=%06x total_read=%u size=%u", m_mem_sel, m_bytes_pending, m_last_address, address, m_bytes_total_read, m_size);

            // If there is a memory discontinuity or the buffer is full send the buffer
            if ((m_last_address + 1) < address || (m_bytes_pending + m_length_transfer) >= MAX_BURST)
            {
                // Configure and send the buffer content, clear pending count
    			//DEBUG_TRACE("ArticTransceiver::send_fw_files: burst_access: mode=%u start_address=%06x pending=%u", m_mode, m_start_address, m_bytes_pending);
                burst_access(m_mode, m_start_address, m_pending_buffer, nullptr, m_bytes_pending, false);
                m_start_address = address;
                m_bytes_pending = 0;

                // Copy next data into the pending buffer
                reverse_memcpy(&(m_pending_buffer[m_bytes_pending]), (uint8_t *) &data, m_length_transfer);
                m_last_address = address;
                m_bytes_pending = m_length_transfer;

                return false; // Reschedule
            }

            // Copy next data into the pending buffer
            reverse_memcpy(&(m_pending_buffer[m_bytes_pending]), (uint8_t *) &data, m_length_transfer);
            m_last_address = address;
            m_bytes_pending += m_length_transfer;
        }

        // If there is data pending to be sent then send it before moving to the next section
		if (m_bytes_pending > 0)
		{
			//DEBUG_TRACE("ArticTransceiver::send_fw_files: burst_access: mode=%u start_address=%06x pending=%u", m_mode, m_start_address, m_bytes_pending);

			burst_access(m_mode, m_start_address, m_pending_buffer, nullptr, m_bytes_pending, false);

			// Select next file
			m_bytes_total_read = 0;
			m_mem_sel++;
        }

        // Continue running until we've programmed all files
        return (m_mem_sel >= NUM_FIRMWARE_FILES_ARTIC);

    },
	[this, on_success](){

    	// FIXME: make this async

    	// Bring DSP out of reset
        DEBUG_TRACE("ArticTransceiver::send_fw_files: Bringing Artic out of reset");
        send_artic_command(DSP_CONFIG, NULL);

        DEBUG_TRACE("ArticTransceiver::send_fw_files: Waiting for interrupt 1");

        // Interrupt 1 will be high when start-up is complete and status shall indicate IDLE
        wait_interrupt(SAT_ARTIC_DELAY_INTERRUPT_1_PROG_MS, INTERRUPT_1, (1<<IDLE));

        DEBUG_TRACE("ArticTransceiver::send_fw_files: Artic booted");

        clear_interrupt(INTERRUPT_1);

        DEBUG_TRACE("ArticTransceiver::send_fw_files: Checking CRC values");
        check_crc(&m_firmware_header);

        on_success();

    }, "SendFirmwareChunk", 0);
}

void ArticTransceiver::program_firmware(std::function<void()> on_success)
{
    DEBUG_TRACE("ArticTransceiver::program_firmware: WAIT DSP RESET");

    // Wait until the device's status register contains 0x55
    // NOTE: This 0x55 value is undocumented but can be seen in the supplied Artic_evalboard.py file
    int retries = 3;

    run_until(m_deferred_task_stopped, [this, &retries]() -> bool {

    	if (--retries < 0)
        {
            DEBUG_ERROR("ArticTransceiver::program_firmware: BOOT ERROR");
            m_notification_callback(ArgosAsyncEvent::ERROR);
            return false;
        } else {
            uint32_t artic_response = 0;
			try {
				send_artic_command(DSP_STATUS, &artic_response);
			} catch (int e) {
				// No action
			}
			return (artic_response == 0x55);
        }
    	return false;
    },
	[this, on_success]() {
		send_fw_files(on_success);
    }, "DspReadyForFirmwareProgramming", SAT_ARTIC_DELAY_BOOT_MS);
}

void ArticTransceiver::set_tcxo_warmup_time(uint32_t time_s)
{
    uint8_t write_buffer[3];
    write_buffer[0] = (time_s) >> 16;
    write_buffer[1] = (time_s) >> 8;
    write_buffer[2] = (time_s);

    burst_access(XMEM, TCXO_WARMUP_TIME_ADDRESS, write_buffer, NULL, sizeof(write_buffer), false);
}

void ArticTransceiver::get_status_register(uint32_t *status)
{
    uint8_t buffer[SIZE_SPI_REG_XMEM_YMEM_IOMEM];

    burst_access(IOMEM, INTERRUPT_ADDRESS, NULL, buffer, SIZE_SPI_REG_XMEM_YMEM_IOMEM,  true);
    *status = 0;
    reverse_memcpy((uint8_t *) status, buffer, SIZE_SPI_REG_XMEM_YMEM_IOMEM);
}

