arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/artic_r2/artic.cpp
	// Assign the buffer to include 24-bit length indicator and rounded-up to 3 bytes for XMEM alignment
	packet.assign(((((total_bits + 24) + 23) / 24) * 24) / 8, 0);

	// Set header
	PACK_BITS(length_enc, packet, op_offset, 4);
	PACK_BITS(argos_id>>8, packet, op_offset, 20);
	PACK_BITS(argos_id, packet, op_offset, 8);

	// Append user payload
	unsigned int payload_bits_remaining = payload_length;
	uint8_t byte;
	while (payload_bits_remaining) {
		unsigned int bits = std::min(8U, payload_bits_remaining);
		payload_bits_remaining -= bits;
		EXTRACT_BITS(byte, user_payload, ip_offset, bits);
		PACK_BITS(byte, packet, op_offset, bits);
	}

	// Add any stuffing bits
	payload_bits_remaining = stuffing_bits;
	while (payload_bits_remaining) {
		unsigned int bits = std::min(8U, payload_bits_remaining);
		payload_bits_remaining -= bits;
		PACK_BITS(0, packet, op_offset, bits);
	}

	// Add tail bits
	PACK_BITS(0, packet, op_offset, num_tail_bits);

	// Setup TX mode
	uint8_t cmd = (mode == ArgosMode::ARGOS_3) ? ARTIC_CMD_SET_PTT_A3_TX_MODE : ARTIC_CMD_SET_PTT_A2_TX_MODE;

	// Send asynchronous command to enable TX mode and start packet transfer
	send_command_check_clean_async(cmd, INTERRUPT_1, (1<<MCU_COMMAND_ACCEPTED), SAT_ARTIC_DELAY_INTERRUPT_MS,
		[this, total_bits, num_tail_bits, packet]() {

		// Set 24-bit total length field (required at the head of the packet data)
		uint8_t *buffer = (uint8_t *)packet.data();
		buffer[0] = total_bits >> 16;
		buffer[1] = total_bits >> 8;
		buffer[2] = total_bits;
	    burst_access(XMEM, TX_PAYLOAD_ADDRESS, (const uint8_t *)buffer, nullptr, packet.length(), false);

	    // Set TCXO warm up
		set_tcxo_warmup_time(m_is_first_tx ? DEFAULT_TCXO_WARMUP_TIME_SECONDS : 0);

		get_and_print_status();

		DEBUG_TRACE("ArticTransceiver::send_packet: data[%u]=%s tail=%u",
				total_bits, Binascii::hexlify(packet).c_str(),
				num_tail_bits);

		// Send to ARTIC the command for sending only one packet and wait for the response TX_FINISHED
		send_command_check_clean_async(ARTIC_CMD_START_TX_1M_SLEEP, INTERRUPT_1, (1<<TX_FINISHED), SAT_ARTIC_TIMEOUT_SEND_TX_MS,
			[this]() {
				m_notification_callback(ArgosAsyncEvent::TX_DONE);
		});
	});
}


void ArticTransceiver::send_ack(const unsigned int argos_id, const unsigned int a_dcs, const unsigned int dl_msg_id, const unsigned int exec_report, const ArgosMode mode)
{
	ArgosPacket packet, crc_packet;
	unsigned int total_bits;
	unsigned int stuffing_bits = 0;
	unsigned int payload_length = 96;
	unsigned int length_enc = 0x5;
	unsigned int service_id = 0x00EBA;

	DEBUG_TRACE("ArticTransceiver::send_ack");

	unsigned int num_tail_bits = 0; // A2 mode
	if (mode == ArgosMode::ARGOS_3)
		num_tail_bits = 9;

	unsigned int crc_offset = 0;
	unsigned int op_offset = 24;  // Keep first 24 bits spare for length field

	// Transmission is:
	// MSG_LEN (4)
	// SERVICEID (20)  +
	// FCS (16)        |
	// ADCS (4)        | *
	// PMTID (28)      | *
	// DLMSGID (16)    | *
	// EXECRPT(4)      | *
	// DATA (28)       + *
	// STUFFING (0)
	// TAIL_BITS (0,7,8,9)
	total_bits = 4 + 20 + payload_length + stuffing_bits + num_tail_bits;

	// Assign a temporary buffer for computing the FCS over the required* fields
	crc_packet.assign(10, 0); // 10 bytes, 80 bits
	PACK_BITS(a_dcs, crc_packet, crc_offset, 4);
	PACK_BITS(argos_id>>8, crc_packet, crc_offset, 20);
	PACK_BITS(argos_id, crc_packet, crc_offset, 8);
	PACK_BITS(dl_msg_id, crc_packet, crc_offset, 16);
	PACK_BITS(exec_report, crc_packet, crc_offset, 4);
	PACK_BITS(0, crc_packet, crc_offset, 28);

	// Compute FCS
	uint16_t fcs = CRC16::checksum(crc_packet, 80);

	// Assign the buffer to include 24-bit length indicator and rounded-up to 3 bytes for XMEM alignment
	packet.assign(((((total_bits + 24) + 23) / 24) * 24) / 8, 0);

	PACK_BITS(length_enc, packet, op_offset, 4);
	PACK_BITS(service_id, packet, op_offset, 20);
	PACK_BITS(fcs, packet, op_offset, 16);
	PACK_BITS(a_dcs, packet, op_offset, 4);
	PACK_BITS(argos_id>>8, packet, op_offset, 20);
	PACK_BITS(argos_id, packet, op_offset, 8);
	PACK_BITS(dl_msg_id, packet, op_offset, 16);
	PACK_BITS(exec_report, packet, op_offset, 4);
	PACK_BITS(0, packet, op_offset, 28);
	PACK_BITS(0, packet, op_offset, stuffing_bits);
	PACK_BITS(0, packet, op_offset, num_tail_bits);

	// Setup TX mode
	uint8_t cmd = (mode == ArgosMode::ARGOS_3) ? ARTIC_CMD_SET_PTT_A3_TX_MODE : ARTIC_CMD_SET_PTT_A2_TX_MODE;
	send_command_check_clean(cmd, INTERRUPT_1, (1<<MCU_COMMAND_ACCEPTED), SAT_ARTIC_DELAY_INTERRUPT_MS);

	// Set 24-bit total length field (required at the head of the packet data)
	uint8_t *buffer = (uint8_t *)packet.data();
	buffer[0] = total_bits >> 16;
	buffer[1] = total_bits >> 8;
	buffer[2] = total_bits;
	burst_access(XMEM, TX_PAYLOAD_ADDRESS, (const uint8_t *)buffer, nullptr, packet.length(), false);

    // Set TCXO warm up
	set_tcxo_warmup_time(m_is_first_tx ? DEFAULT_TCXO_WARMUP_TIME_SECONDS : 0);

	get_and_print_status();

	DEBUG_TRACE("ArticTransceiver::send_ack: data[%u]=%s tail=%u",
			total_bits, Binascii::hexlify(packet).c_str(),
			num_tail_bits);

	// Send to ARTIC the command for sending only one packet and wait for the response TX_FINISHED
	send_command_check_clean(ARTIC_CMD_START_TX_1M_SLEEP, INTERRUPT_1, (1<<TX_FINISHED), SAT_ARTIC_TIMEOUT_SEND_TX_MS);
}

void ArticTransceiver::set_frequency(const double freq) {
	unsigned int fractional_part;
	fractional_part = (unsigned int)std::round((((4.0 * freq * 1E6) / 26E6) - 61.0) * 4194304.0);

    uint8_t write_buffer[3];
    write_buffer[0] = (fractional_part) >> 16;
    write_buffer[1] = (fractional_part) >> 8;
    write_buffer[2] = (fractional_part);

	// Only supports Argos 2 and 3 band
	burst_access(XMEM, TX_FREQUENCY_ARGOS_2_3, write_buffer, NULL, sizeof(write_buffer), false);
}

void ArticTransceiver::set_tx_power(const BaseArgosPower power) {
#ifndef BOARD_LINKIT
	(void)power;
#else
	// GA16 and GA8 pins allows PA gain to be set only coarsely as:
	// 0dB   - 00
	// 8dB   - 01
	// 16dB  - 10
	// 24dB  - 11
	GPIOPins::clear(BSP::GPIO::GPIO_G8_33);
	GPIOPins::clear(BSP::GPIO::GPIO_G16_33);
	switch (power) {
	case BaseArgosPower::POWER_40_MW:
		GPIOPins::set(BSP::GPIO::GPIO_G16_33);
		break;
	case BaseArgosPower::POWER_500_MW:
	case BaseArgosPower::POWER_200_MW:
		GPIOPins::set(BSP::GPIO::GPIO_G8_33);
		GPIOPins::set(BSP::GPIO::GPIO_G16_33);
		break;
	case BaseArgosPower::POWER_3_MW:
		GPIOPins::set(BSP::GPIO::GPIO_G8_33);
		break;
	default:
		break;

	}
#endif
}
